Revit 2027 API
StairsRunType.RiserProfile Property
 The id of the profile of the risers.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId RiserProfile { get; set; }
Public Property RiserProfile As ElementId
	Get
	Set
public:
property ElementId^ RiserProfile {
	ElementId^ get ();
	void set (ElementId^ value);
}
member RiserProfile : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The profile is neither a valid element id nor invalidElementId. -or- When setting this property: The profile is not a valid riser profile symbol.
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  When setting this property: The run type has no riser so the data being set is not applicable.
See Also
Reference
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace